modm-ext/data.modm.io/docs/svd/header_stm32f413xx.svd
        <register>
          <name>DCKCFGR</name>
          <description>RCC Dedicated Clocks configuration register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLLI2SDIVR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_5</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_7</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_17</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_18</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_19</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_20</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_21</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_22</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_23</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_24</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_25</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_26</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_27</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_28</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_29</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_30</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_31</name>
                  <description>PLLI2S division factor for PLLI2SDIVR output by 31</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLDIVR</name>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>PLL division factor for PLLDIVR output by 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>PLL division factor for PLLDIVR output by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <description>PLL division factor for PLLDIVR output by 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>PLL division factor for PLLDIVR output by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_5</name>
                  <description>PLL division factor for PLLDIVR output by 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>PLL division factor for PLLDIVR output by 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_7</name>
                  <description>PLL division factor for PLLDIVR output by 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>PLL division factor for PLLDIVR output by 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <description>PLL division factor for PLLDIVR output by 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>PLL division factor for PLLDIVR output by 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <description>PLL division factor for PLLDIVR output by 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>PLL division factor for PLLDIVR output by 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <description>PLL division factor for PLLDIVR output by 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>PLL division factor for PLLDIVR output by 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <description>PLL division factor for PLLDIVR output by 15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>PLL division factor for PLLDIVR output by 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_17</name>
                  <description>PLL division factor for PLLDIVR output by 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_18</name>
                  <description>PLL division factor for PLLDIVR output by 18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_19</name>
                  <description>PLL division factor for PLLDIVR output by 19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_20</name>
                  <description>PLL division factor for PLLDIVR output by 20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_21</name>
                  <description>PLL division factor for PLLDIVR output by 21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_22</name>
                  <description>PLL division factor for PLLDIVR output by 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_23</name>
                  <description>PLL division factor for PLLDIVR output by 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_24</name>
                  <description>PLL division factor for PLLDIVR output by 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_25</name>
                  <description>PLL division factor for PLLDIVR output by 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_26</name>
                  <description>PLL division factor for PLLDIVR output by 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_27</name>
                  <description>PLL division factor for PLLDIVR output by 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_28</name>
                  <description>PLL division factor for PLLDIVR output by 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_29</name>
                  <description>PLL division factor for PLLDIVR output by 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_30</name>
                  <description>PLL division factor for PLLDIVR output by 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_31</name>
                  <description>PLL division factor for PLLDIVR output by 31</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKDFSDM2ASEL</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKDFSDM1ASEL</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAI1ASRC</name>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SAI1BSRC</name>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMPRE</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWICE</name>
                  <description>Timers clock to twice PCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_TIMES</name>
                  <description>Timers clock to four time PCLK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S1SRC</name>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>I2S2SRC</name>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKDFSDM1SEL</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFSDM1_CLKSOURCE_PCLK2</name>
                  <description>PCLK2 clock used as DFSDM1 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFSDM1_CLKSOURCE_SYSCLK</name>
                  <description>System clock used as DFSDM1 clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CKGATENR</name>
          <description>RCC Clocks Gated ENable Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AHB2APB1_CKEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2APB2_CKEN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CM4DBG_CKEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPARE_CKEN</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM_CKEN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLITF_CKEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCC_CKEN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCC_EVTCTL</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCKCFGR2</name>
          <description>RCC Dedicated Clocks configuration register 2</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FMPI2C1SEL</name>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK1</name>
                  <description>PCLK1 clock used as FMPI2C1 clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>SYSCLK clock used as FMPI2C1 clock source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI clock used as FMPI2C1 clock source</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CK48MSEL</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOSEL</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK1</name>
                  <description>PCLK1 clock used as LPTIM1 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>LSI oscillator clock used as LPTIM1 clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>HSI oscillator clock used as LPTIM1 clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE oscillator clock used as LPTIM1 clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
